/*******************************************************************************
                      版权所有 (C), 2020-,NCUROBOT
 *******************************************************************************
  文 件 名   : bsp.c
  版 本 号   : V1.0
  作    者   : 高云海
  生成日期   : 2020.11.18
  最近修改   : 
  功能描述   : 所用外设使用初始化汇总
  函数列表   : 1) BSP_Init()			【外部调用：main.c】
*******************************************************************************/
/* 包含头文件 ----------------------------------------------------------------*/
#include "bsp.h"

#include "bsp_can.h"
#include "vision.h"
#include "referee.h"
#include "offline_check.h"
#include "remote_control.h"
#include "pid_wireless_debug.h"
#include "bsp_delay.h"
#include "bsp_usart.h"
#include "bsp_imu_pwm.h"

/* 内部宏定义 ----------------------------------------------------------------*/

/* 内部自定义数据类型的变量 --------------------------------------------------*/

/* 内部变量 ------------------------------------------------------------------*/

/* 内部函数原型声明 ----------------------------------------------------------*/

/* 函数主体部分 --------------------------------------------------------------*/

/**
  * @brief				所用外设初始化函数【主函数中调用】
  * @param[out]		
  * @param[in]		
  * @retval				
*/
void BSP_Init (void)
{
 delay_init();                     //陀螺仪延时函数初始化
	Remote_Control_USART_Init();				  //遥控器数据接收  				【usart3】
	BSP_CAN_Init(&hcan1);								     //CAN1初始化								  【can1】
	BSP_CAN_Init(&hcan2);								     //CAN2初始化								  【can2】
	Off_Line_Detect_Init();					    		//断线检测初始化						【tim4】	
	BSP_temp_Init();                  //陀螺仪pwm控温初始化 【tim10】
	Wireless_Debug_USART_Init();				  //PID无线调参初始化			【usart1】
	VisionDate_Receive_USART_Init();  //视觉接受初始化					 【usart6】
}
